# @Author : 杨佳杰
# @Time   : 2022/6/13 14:05
# @File   : 3-位图.py
def bitmap(arr):
    int_bitmap = 0  # 初始时位图上每位均为0
    result = []  # 放置不重复的结果
    for i in arr:
        if not int_bitmap & 1 << i:
            # 相与时,仅对应位出现过,1&1=1,则不做处理,未出现过0&1=0,则压入结果并将对应位置为1
            result.append(i)  # 这个数没出现过，放入result
            int_bitmap |= 1 << i  # 这个数出现了，把对应位置标记为1
    result.sort()
    print(result)
    print(len(result))


if __name__ == '__main__':
    list1 = [95, 17, 3, 31, 86, 75, 56, 19, 38, 26,
             94, 54, 53, 72, 59, 61, 74, 58, 78, 60,
             64, 43, 52, 90, 84, 19, 92, 2, 71, 12,
             67, 10, 53, 85, 98, 24, 11, 41, 44, 55,
             10, 47, 43, 98, 9, 55, 18, 30, 44, 22,
             48, 15, 87, 28, 47, 18, 92, 3, 38, 87, 59,
             84, 76, 65, 82, 26, 47, 52, 58, 79, 50, 82,
             5, 71, 28, 30, 17, 51, 11, 58, 12, 54, 49, 73,
             24, 46, 99, 94, 93, 70, 12, 33, 19, 67, 62, 74, 61, 89, 91, 51]
    bitmap(list1)
    print('-' * 50)
    print(set(list1))
    print(len(set(list1)))
